In [1]:
import pandas as pd

# `pandas.DataFrame.fillna`

In [15]:
# Create a sample DataFrame with NaN values
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, None, 30, None],
    'City': ['New York', 'Los Angeles', None, 'Chicago']
}

df = pd.DataFrame(data)
df

      Name   Age         City
0    Alice  25.0     New York
1      Bob   NaN  Los Angeles
2  Charlie  30.0         None
3    David   NaN      Chicago

In [18]:
# Fill NaN values
df_filled = df.fillna({
    'Age': df['Age'].mean(),     # Fill missing ages with the mean
    'City': 'Unknown'            # Fill missing cities with a placeholder
})
df_filled

      Name   Age         City
0    Alice  25.0     New York
1      Bob  27.5  Los Angeles
2  Charlie  30.0      Unknown
3    David  27.5      Chicago

# `pandas.DataFrame.drop`

In [2]:
df = pd.DataFrame([{'name': 'Asdas', 'age': 23}, {'name': 'Basdas', 'age': 22}, {'name': 'Casdas', 'age': 21}])
df

     name  age
0   Asdas   23
1  Basdas   22
2  Casdas   21

In [3]:
df.drop('age', axis=1)

     name
0   Asdas
1  Basdas
2  Casdas

In [4]:
df

     name  age
0   Asdas   23
1  Basdas   22
2  Casdas   21

In [5]:
df.drop('age', axis=1, inplace=True)

In [6]:
df

     name
0   Asdas
1  Basdas
2  Casdas

In [9]:
df.drop([0,1], axis=0)

     name
2  Casdas

In [13]:
# help(df.drop)